---
kind: other
id: Events.T:Autodesk.Revit.UI.Macros.ApplicationEntryPoint
source: html/0d295f42-9d0a-af04-0599-6f91aeee2264.htm
---
# ApplicationEntryPoint Events

Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.